```markdown
# ğŸŒ Packet Tracer: ConfiguraciÃ³n de NAT para IPv4

[![Cisco Packet Tracer](https://img.shields.io/badge/Cisco-Packet_Tracer-1BA0D7.svg)](https://www.netacad.com/courses/packet-tracer)
[![NAT](https://img.shields.io/badge/Protocol-NAT-green.svg)](https://www.cisco.com/c/en/us/support/docs/ip/network-address-translation-nat/26704-nat-faq-00.html)
[![IPv4](https://img.shields.io/badge/IP-IPv4-blue.svg)](https://es.wikipedia.org/wiki/IPv4)
[![Cisco IOS](https://img.shields.io/badge/Cisco-IOS-orange.svg)](https://www.cisco.com/c/en/us/products/ios-nx-os-software/ios-technologies/index.html)
[![License](https://img.shields.io/badge/License-Educational-yellow.svg)](LICENSE)

<div align="center">

**Laboratorio PrÃ¡ctico de Network Address Translation (NAT) y Port Address Translation (PAT)**

[ğŸ“‹ Tabla de Direcciones](#-tabla-de-asignaciÃ³n-de-direcciones) â€¢
[ğŸ¯ Objetivos](#-objetivos-del-proyecto) â€¢
[ğŸš€ ConfiguraciÃ³n](#ï¸-configuraciÃ³n-paso-a-paso) â€¢
[ğŸ” VerificaciÃ³n](#-verificaciÃ³n-y-pruebas) â€¢
[ğŸ“š Recursos](#-recursos-y-referencias)

</div>

---

## ğŸ“‹ DescripciÃ³n del Proyecto

Este proyecto implementa una soluciÃ³n completa de **Network Address Translation (NAT)** en un entorno empresarial simulado con Cisco Packet Tracer. La configuraciÃ³n aborda uno de los problemas mÃ¡s comunes en redes corporativas: permitir que mÃºltiples dispositivos en redes privadas accedan a Internet utilizando un nÃºmero limitado de direcciones IP pÃºblicas.

### ğŸ” Â¿QuÃ© es NAT y por quÃ© es importante?

**NAT (Network Address Translation)** es una tecnologÃ­a fundamental que traduce direcciones IP privadas a direcciones IP pÃºblicas. En este laboratorio se implementan dos tipos de NAT:

- **NAT DinÃ¡mico con PAT (Port Address Translation)**: Conocido tambiÃ©n como "NAT Overload", permite que cientos o miles de dispositivos internos compartan una Ãºnica direcciÃ³n IP pÃºblica mediante el uso de diferentes puertos. Esto soluciona la escasez de direcciones IPv4 pÃºblicas y aÃ±ade una capa de seguridad al ocultar la topologÃ­a interna de la red.

- **NAT EstÃ¡tico**: Crea un mapeo permanente uno a uno entre una direcciÃ³n IP privada y una pÃºblica. Es ideal para servidores internos que deben ser accesibles desde Internet con una direcciÃ³n IP pÃºblica constante.

### ğŸ¢ Escenario del Laboratorio

Una empresa cuenta con tres redes LAN internas (LAN1, LAN2 y LAN3) que necesitan acceso a Internet, ademÃ¡s de un servidor interno que debe ser accesible desde el exterior. El router **R2** actÃºa como punto central de traducciÃ³n NAT, permitiendo:

- âœ… Que todos los dispositivos de las 3 LANs accedan a Internet compartiendo una sola IP pÃºblica
- âœ… Que el servidor interno sea accesible desde Internet con una IP pÃºblica dedicada
- âœ… ConservaciÃ³n eficiente del espacio limitado de direcciones IPv4 pÃºblicas
- âœ… Mayor seguridad al ocultar las direcciones internas de la organizaciÃ³n

---

## ğŸ¯ Objetivos del Proyecto

### Objetivos TÃ©cnicos

- ğŸ”§ **Configurar NAT DinÃ¡mico con PAT**: Implementar traducciÃ³n de direcciones para mÃºltiples hosts usando overload
- ğŸ”’ **Configurar NAT EstÃ¡tico**: Establecer mapeo permanente para servidor interno
- ğŸ“ **Crear ACL Nombrada**: Implementar listas de control de acceso para definir trÃ¡fico NAT
- ğŸŒŠ **Configurar Pool de Direcciones**: Administrar el conjunto de IPs pÃºblicas disponibles
- âœ… **Validar Conectividad**: Verificar comunicaciÃ³n bidireccional entre redes internas e Internet

### Objetivos de Aprendizaje

- Comprender el funcionamiento de NAT y PAT en entornos reales
- Dominar la configuraciÃ³n de Cisco IOS para servicios de traducciÃ³n de direcciones
- Aplicar mejores prÃ¡cticas en el diseÃ±o de redes empresariales
- Desarrollar habilidades de troubleshooting en problemas de conectividad NAT

---

## ğŸ“Š Tabla de AsignaciÃ³n de Direcciones

### ğŸ”¹ Dispositivos de Red - Routers

| Dispositivo | Interfaz | DirecciÃ³n IP | MÃ¡scara | Tipo de Red |
|------------|----------|--------------|---------|-------------|
| **R1** | S0/0/0 | 10.1.1.1 | /30 | WAN (Enlace R1-R2) |
| **R1** | F0/0 | 192.168.10.1 | /24 | LAN1 (Red Interna 1) |
| **R2** | S0/0/0 | 10.1.1.2 | /30 | WAN (ConexiÃ³n a R1) |
| **R2** | S0/0/1 | 10.2.2.1 | /30 | WAN (ConexiÃ³n a R3) |
| **R2** | S0/1/0 | 209.165.200.225 | /27 | Internet (Enlace ISP) |
| **R2** | F0/0/0 | 192.168.20.1 | /24 | LAN2 (Red del Servidor) |
| **R3** | S0/0/1 | 10.2.2.2 | /30 | WAN (Enlace R3-R2) |
| **R3** | F0/0 | 192.168.30.1 | /24 | LAN3 (Red Interna 3) |

### ğŸ”¹ Dispositivos Finales

| Dispositivo | IP | MÃ¡scara | Gateway | DescripciÃ³n |
|------------|-----|---------|---------|-------------|
| **PC1** | 192.168.10.10 | /24 | 192.168.10.1 | Cliente en LAN1 |
| **PC2** | 192.168.30.10 | /24 | 192.168.30.1 | Cliente en LAN3 |
| **local.pka** | 192.168.20.254 | /24 | 192.168.20.1 | Servidor Web/DNS Interno |
| **PC exterior** | 209.165.201.14 | /28 | - | Cliente externo (Internet) |
| **cisco.pka** | 209.165.201.30 | /28 | - | Servidor pÃºblico (Internet) |

### ğŸ”¹ Pool de Direcciones NAT

| PropÃ³sito | DirecciÃ³n IP | Red CIDR | Uso |
|-----------|--------------|----------|-----|
| **NAT DinÃ¡mico (PAT)** | 209.165.202.129 | 209.165.202.128/30 | Primera direcciÃ³n - Overload para todas las LANs |
| **NAT EstÃ¡tico** | 209.165.202.130 | 209.165.202.128/30 | Segunda direcciÃ³n - Servidor local.pka |

**Nota**: La red 209.165.202.128/30 proporciona 2 direcciones IP utilizables (la .129 y .130), perfectas para nuestros dos propÃ³sitos.

---

## ğŸ› ï¸ TecnologÃ­as y Conceptos

### Stack TecnolÃ³gico

```
ğŸ–¥ï¸ Simulador de Red
   â””â”€ Cisco Packet Tracer 7.3+

ğŸŒ Protocolos y TecnologÃ­as
   â”œâ”€ IPv4 Addressing & Subnetting
   â”œâ”€ NAT (Network Address Translation)
   â”œâ”€ PAT (Port Address Translation)
   â”œâ”€ ACL (Access Control Lists)
   â”œâ”€ Static Routing
   â””â”€ ICMP Protocol

ğŸ”§ Equipamiento
   â””â”€ Cisco Routers (2900 Series - IOS)
```

### Conceptos de NAT Implementados

| TecnologÃ­a | DescripciÃ³n | AplicaciÃ³n en este Lab |
|------------|-------------|------------------------|
| **NAT DinÃ¡mico con PAT** | MÃºltiples IPs internas â†’ Una IP pÃºblica usando puertos diferentes | Acceso a Internet para LAN1, LAN2, LAN3 |
| **NAT EstÃ¡tico** | Mapeo permanente 1:1 entre IP privada y pÃºblica | Servidor local.pka accesible desde Internet |
| **Inside Interface** | Interfaz conectada a la red interna privada | S0/0/0, S0/0/1, F0/0 en R2 |
| **Outside Interface** | Interfaz conectada a la red externa pÃºblica | S0/1/0 en R2 |
| **ACL Nombrada** | Lista de control que define quÃ© trÃ¡fico se traduce | R2NAT (permite 3 LANs) |
| **NAT Pool** | Conjunto de direcciones IP pÃºblicas para traducciÃ³n | R2POOL (209.165.202.129) |

### TerminologÃ­a NAT

```
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚  Inside Local:  IP privada del host interno (192.168.x.x)  â”‚
â”‚  Inside Global: IP pÃºblica que representa al host interno   â”‚
â”‚  Outside Local: IP del host externo vista desde dentro      â”‚
â”‚  Outside Global: IP real del host en Internet               â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

---

## âš™ï¸ ConfiguraciÃ³n Paso a Paso

### ğŸ¯ Instrucciones Generales

En esta actividad se configurarÃ¡ **Ãºnicamente el router R2**, que actuarÃ¡ como gateway NAT para todas las redes internas. Siga cuidadosamente cada paso respetando los nombres exactos especificados.

---

### ğŸ“ Fase 1: Crear Access Control List (ACL) Nombrada

Las ACLs determinan quÃ© trÃ¡fico serÃ¡ traducido por NAT. En este caso, permitiremos que las tres redes LAN internas sean traducidas.

```cisco
! Acceder al modo de configuraciÃ³n global
R2> enable
R2# configure terminal

! Crear ACL estÃ¡ndar nombrada "R2NAT"
! âš ï¸ IMPORTANTE: El nombre debe ser exactamente "R2NAT" (case-sensitive)
R2(config)# ip access-list standard R2NAT

! Permitir traducciÃ³n de LAN1 (192.168.10.0/24)
R2(config-std-nacl)# permit 192.168.10.0 0.0.0.255

! Permitir traducciÃ³n de LAN2 (192.168.20.0/24)
R2(config-std-nacl)# permit 192.168.20.0 0.0.0.255

! Permitir traducciÃ³n de LAN3 (192.168.30.0/24)
R2(config-std-nacl)# permit 192.168.30.0 0.0.0.255

! Salir del modo de configuraciÃ³n de ACL
R2(config-std-nacl)# exit
```

**ğŸ” ExplicaciÃ³n**:
- `ip access-list standard R2NAT`: Crea una ACL estÃ¡ndar con nombre descriptivo
- `permit 192.168.x.0 0.0.0.255`: La wildcard mask 0.0.0.255 equivale a /24 (coincide con los primeros 3 octetos)
- **Orden crÃ­tico**: Deben especificarse en orden LAN1 â†’ LAN2 â†’ LAN3

---

### ğŸ“ Fase 2: Crear Pool de Direcciones NAT

El pool NAT define el conjunto de direcciones IP pÃºblicas disponibles para la traducciÃ³n dinÃ¡mica.

```cisco
! Crear pool NAT llamado "R2POOL"
! âš ï¸ IMPORTANTE: El nombre debe ser exactamente "R2POOL" (case-sensitive)
R2(config)# ip nat pool R2POOL 209.165.202.129 209.165.202.129 netmask 255.255.255.252
```

**ğŸ” Desglose del comando**:

```
ip nat pool R2POOL 209.165.202.129 209.165.202.129 netmask 255.255.255.252
â”‚            â”‚      â”‚                â”‚                â”‚
â”‚            â”‚      â”‚                â”‚                â””â”€ MÃ¡scara de subred (/30)
â”‚            â”‚      â”‚                â””â”€ IP final del rango (misma = un solo IP)
â”‚            â”‚      â””â”€ IP inicial del rango
â”‚            â””â”€ Nombre del pool
â””â”€ Comando de creaciÃ³n
```

**ğŸ“Š AnÃ¡lisis del espacio de direcciones 209.165.202.128/30**:

| Elemento | DirecciÃ³n IP | Uso |
|----------|--------------|-----|
| DirecciÃ³n de red | 209.165.202.128 | No utilizable |
| Primera IP utilizable | **209.165.202.129** | **NAT DinÃ¡mico (Pool)** |
| Segunda IP utilizable | **209.165.202.130** | **NAT EstÃ¡tico (Servidor)** |
| Broadcast | 209.165.202.131 | No utilizable |

---

### ğŸ“ Fase 3: Configurar NAT DinÃ¡mico con PAT (Overload)

Este comando asocia la ACL con el pool y habilita PAT mediante la palabra clave `overload`.

```cisco
! Configurar NAT dinÃ¡mico con PAT
R2(config)# ip nat inside source list R2NAT pool R2POOL overload
```

**ğŸ” ExplicaciÃ³n de parÃ¡metros**:

| ParÃ¡metro | FunciÃ³n |
|-----------|---------|
| `ip nat inside source` | Define traducciÃ³n para trÃ¡fico originado dentro de la red |
| `list R2NAT` | Usa la ACL "R2NAT" para identificar quÃ© hosts traducir |
| `pool R2POOL` | Usa el pool "R2POOL" como fuente de IPs pÃºblicas |
| `overload` | **Habilita PAT**: permite mÃºltiples hosts en una sola IP usando puertos |

**ğŸ’¡ Â¿CÃ³mo funciona el Overload (PAT)?**

```
Host Interno              Puerto    â†’    IP PÃºblica Compartida
â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
192.168.10.10:3500        3500     â†’    209.165.202.129:3500
192.168.20.50:3501        3501     â†’    209.165.202.129:3501
192.168.30.10:3502        3502     â†’    209.165.202.129:3502
192.168.10.15:3503        3503     â†’    209.165.202.129:3503
```

Todos los dispositivos comparten la misma IP pÃºblica (209.165.202.129) pero R2 diferencia las conexiones por el nÃºmero de puerto.

---

### ğŸ“ Fase 4: Configurar NAT EstÃ¡tico para el Servidor

NAT estÃ¡tico crea un mapeo permanente para que el servidor interno sea accesible desde Internet.

```cisco
! Mapear servidor interno a IP pÃºblica
! Inside Local: 192.168.20.254 (local.pka)
! Inside Global: 209.165.202.130 (IP pÃºblica del servidor)
R2(config)# ip nat inside source static 192.168.20.254 209.165.202.130
```

**ğŸ” AnÃ¡lisis del mapeo**:

```
ip nat inside source static 192.168.20.254 209.165.202.130
                             â”‚               â”‚
                             â”‚               â””â”€ IP PÃºblica (Inside Global)
                             â””â”€ IP Privada del Servidor (Inside Local)
```

**ğŸ“ CaracterÃ­sticas del NAT EstÃ¡tico**:
- âœ… Mapeo **permanente** (activo incluso sin trÃ¡fico)
- âœ… Siempre usa la **misma IP pÃºblica**
- âœ… Permite que hosts externos inicien conexiones hacia el servidor
- âœ… Ideal para servidores web, email, DNS, etc.

---

### ğŸ“ Fase 5: Configurar Interfaces Inside y Outside

NAT necesita saber quÃ© interfaces conectan a redes internas (inside) y cuÃ¡l conecta a Internet (outside).

```cisco
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! INTERFACES INSIDE (Redes Internas)
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•

! Serial0/0/0 - ConexiÃ³n a R1 (conduce trÃ¡fico de LAN1)
R2(config)# interface Serial0/0/0
R2(config-if)# ip nat inside
R2(config-if)# exit

! Serial0/0/1 - ConexiÃ³n a R3 (conduce trÃ¡fico de LAN3)
R2(config)# interface Serial0/0/1
R2(config-if)# ip nat inside
R2(config-if)# exit

! FastEthernet0/0 - LAN2 directamente conectada (red del servidor)
R2(config)# interface FastEthernet0/0
R2(config-if)# ip nat inside
R2(config-if)# exit

! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! INTERFAZ OUTSIDE (Red Externa)
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•

! Serial0/1/0 - ConexiÃ³n a Internet (ISP)
R2(config)# interface Serial0/1/0
R2(config-if)# ip nat outside
R2(config-if)# exit

! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! GUARDAR CONFIGURACIÃ“N
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•

R2(config)# exit
R2# write memory
! o alternativamente:
! R2# copy running-config startup-config
```

**ğŸ—ºï¸ Diagrama de Interfaces**:

```
        INSIDE                      R2                      OUTSIDE
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”     â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”     â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚  LAN1             â”‚     â”‚                 â”‚     â”‚                â”‚
â”‚  192.168.10.0/24  â”œâ”€â”€â”€â”€â”€â”¤ S0/0/0 (inside) â”‚     â”‚                â”‚
â”‚                   â”‚     â”‚                 â”‚     â”‚                â”‚
â”‚  LAN2             â”‚     â”‚                 â”‚     â”‚   Internet     â”‚
â”‚  192.168.20.0/24  â”œâ”€â”€â”€â”€â”€â”¤ F0/0 (inside)   â”‚     â”‚                â”‚
â”‚  (Servidor)       â”‚     â”‚                 â”‚     â”‚ S0/1/0         â”‚
â”‚                   â”‚     â”‚                 â”œâ”€â”€â”€â”€â”€â”¤ (outside)      â”‚
â”‚  LAN3             â”‚     â”‚ S0/0/1 (inside) â”‚     â”‚                â”‚
â”‚  192.168.30.0/24  â”œâ”€â”€â”€â”€â”€â”¤                 â”‚     â”‚ 209.165.200.0  â”‚
â”‚                   â”‚     â”‚                 â”‚     â”‚                â”‚
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜     â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜     â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
```

---

### ğŸ“‹ ConfiguraciÃ³n Completa - Bloque Unificado

```cisco
!
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
! CONFIGURACIÃ“N COMPLETA DE NAT EN ROUTER R2
! Laboratorio: Configure NAT para IPv4
! â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•â•
!
enable
configure terminal
!
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! PASO 1: Crear ACL Nombrada para definir trÃ¡fico NAT
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
ip access-list standard R2NAT
 permit 192.168.10.0 0.0.0.255
 permit 192.168.20.0 0.0.0.255
 permit 192.168.30.0 0.0.0.255
 exit
!
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! PASO 2: Crear Pool de Direcciones NAT
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
ip nat pool R2POOL 209.165.202.129 209.165.202.129 netmask 255.255.255.252
!
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! PASO 3: Configurar NAT DinÃ¡mico con PAT (Overload)
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
ip nat inside source list R2NAT pool R2POOL overload
!
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! PASO 4: Configurar NAT EstÃ¡tico para Servidor
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
ip nat inside source static 192.168.20.254 209.165.202.130
!
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! PASO 5: Configurar Interfaces NAT
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
!
! Interfaces INSIDE
interface Serial0/0/0
 ip nat inside
!
interface Serial0/0/1
 ip nat inside
!
interface FastEthernet0/0
 ip nat inside
!
! Interfaz OUTSIDE
interface Serial0/1/0
 ip nat outside
!
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Guardar configuraciÃ³n
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
exit
write memory
!
end
!
```

---

## ğŸ” VerificaciÃ³n y Pruebas

### 1ï¸âƒ£ Verificar Traducciones NAT Activas

```cisco
R2# show ip nat translations

! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Salida esperada:
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Pro Inside global      Inside local       Outside local      Outside global
! --- 209.165.202.130    192.168.20.254     ---                ---
! tcp 209.165.202.129:80 192.168.10.10:1025 209.165.201.14:80  209.165.201.14:80
! icmp 209.165.202.129:1 192.168.30.10:1    209.165.201.30:1   209.165.201.30:1
```

**InterpretaciÃ³n**:
- **Primera lÃ­nea**: NAT estÃ¡tico del servidor (permanente)
- **Segunda lÃ­nea**: NAT dinÃ¡mico de PC1 navegando web
- **Tercera lÃ­nea**: NAT dinÃ¡mico de PC2 haciendo ping

---

### 2ï¸âƒ£ Verificar EstadÃ­sticas NAT

```cisco
R2# show ip nat statistics

! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! InformaciÃ³n mostrada:
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Total active translations: 5 (1 static, 4 dynamic; 2 extended)
! Peak translations: 8
! Outside interfaces:
!   Serial0/1/0
! Inside interfaces:
!   Serial0/0/0, Serial0/0/1, FastEthernet0/0
! Hits: 247  Misses: 0
! Pool R2POOL: netmask 255.255.255.252
!         start 209.165.202.129 end 209.165.202.129
!         type generic, total addresses 1, allocated 1 (100%), misses 0
```

**MÃ©tricas importantes**:
- **Hits**: NÃºmero de paquetes traducidos exitosamente
- **Misses**: Paquetes que no encontraron traducciÃ³n (debe ser 0)
- **Pool allocated**: Porcentaje de IPs del pool en uso

---

### 3ï¸âƒ£ Verificar ACL

```cisco
R2# show access-lists

! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Salida esperada:
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Standard IP access list R2NAT
!     10 permit 192.168.10.0, wildcard bits 0.0.0.255 (15 matches)
!     20 permit 192.168.20.0, wildcard bits 0.0.0.255 (8 matches)
!     30 permit 192.168.30.0, wildcard bits 0.0.0.255 (12 matches)
```

**Nota**: Los `matches` indican cuÃ¡ntos paquetes han coincidido con cada regla.

---

### 4ï¸âƒ£ Verificar Pool NAT

```cisco
R2# show ip nat pool

! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Salida esperada:
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Pool R2POOL
!  Refcount 3
!  Netmask 255.255.255.252
!  Start 209.165.202.129
!  End 209.165.202.129
!  Type generic, Total addresses 1, Allocated 1 (100%), Misses 0
```

---

### 5ï¸âƒ£ Probar Conectividad End-to-End

#### Prueba 1: Desde PC1 (LAN1) hacia Internet

```cisco
! En PC1 (192.168.10.10)
PC> ping 209.165.201.14

! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Salida esperada:
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Pinging 209.165.201.14 with 32 bytes of data:
! 
! Reply from 209.165.201.14: bytes=32 time=10ms TTL=125
! Reply from 209.165.201.14: bytes=32 time=9ms TTL=125
! Reply from 209.165.201.14: bytes=32 time=11ms TTL=125
! Reply from 209.165.201.14: bytes=32 time=10ms TTL=125
! 
! Ping statistics for 209.165.201.14:
!     Packets: Sent = 4, Received = 4, Lost = 0 (0% loss)
```

**âœ… Resultado esperado**: Ping exitoso (4/4 paquetes recibidos)

#### Prueba 2: Desde PC2 (LAN3) hacia servidor externo

```cisco
! En PC2 (192.168.30.10)
PC> ping cisco.pka

! Debe resolver a 209.165.201.30 y recibir respuestas
```

**âœ… Resultado esperado**: Ping exitoso

#### Prueba 3: Desde Internet hacia el Servidor Interno (NAT EstÃ¡tico)

```cisco
! En PC-Exterior (209.165.201.14)
PC> ping 209.165.202.130

! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Salida esperada:
! â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€
! Pinging 209.165.202.130 with 32 bytes of data:
! 
! Reply from 209.165.202.130: bytes=32 time=5ms TTL=126
! Reply from 209.165.202.130: bytes=32 time=6ms TTL=126
! Reply from 209.165.202.130: bytes=32 time=5ms TTL=126
! Reply from 209.165.202.130: bytes=32 time=6ms TTL=126
```

**âœ… Resultado esperado**: El servidor local.pka (192.168.20.254) responde a travÃ©s de su IP pÃºblica

#### Prueba 4: Verificar traducciones simultÃ¡neas (PAT)

```cisco
! Generar trÃ¡fico desde mÃºltiples hosts al mismo tiempo:
! - PC1: ping 209.165.201.14
! - PC2: ping 209.165.201.30
! - Desde R1: ping 209.165.201.14

! En R2
R2# show ip nat translations verbose

! Debe mostrar mÃºltiples entradas usando 209.165.202.129 con diferentes puertos
```

**âœ… Resultado esperado**: MÃºltiples traducciones activas compartiendo la misma IP pÃºblica

---

## ğŸ”§ Troubleshooting

### Problema 1: No hay traducciÃ³n NAT

**ğŸ”´ SÃ­ntomas**:
```
PC> ping 209.165.201.14
Request timed out.
Request timed out.
```

**ğŸ” DiagnÃ³stico**:

```cisco
R2# show ip nat translations
! Tabla vacÃ­a o sin entrada para la IP origen

R2# show ip nat statistics
! Muestra Misses > 0
```

**âœ… Soluciones**:

1. Verificar que las interfaces estÃ©n correctamente marcadas:
```cisco
R2# show ip interface Serial0/0/0 | include NAT
! Debe mostrar: NAT: inside

R2# show ip interface Serial0/1/0 | include NAT
! Debe mostrar: NAT: outside
```

2. Verificar que la ACL permita la red:
```cisco
R2# show access-lists
! Confirmar que la red del host estÃ© en R2NAT
```

3. Re-aplicar configuraciÃ³n de interfaces si es necesario:
```cisco
R2(config)# interface Serial0/0/0
R2(config-if)# ip nat inside
```

---

### Problema 2: El servidor no es accesible desde Internet

**ğŸ”´ SÃ­ntomas**:
```
PC-Exterior> ping 209.165.202.130
Request timed out.
```

**ğŸ” DiagnÃ³stico**:

```cisco
R2# show ip nat translations | include 192.168.20.254
! No aparece la entrada estÃ¡tica
```

**âœ… Soluciones**:

1. Verificar configuraciÃ³n de NAT estÃ¡tico:
```cisco
R2# show running-config | include ip nat inside source static
! Debe mostrar: ip nat inside source static 192.168.20.254 209.165.202.130
```

2. Re-configurar si es necesario:
```cisco
R2(config)# no ip nat inside source static 192.168.20.254 209.165.202.130
R2(config)# ip nat inside source static 192.168.20.254 209.165.202.130
```

3. Verificar que la interfaz F0/0 estÃ© como inside:
```cisco
R2# show ip interface FastEthernet0/0 | include NAT
```

---

### Problema 3: Nombres de ACL o Pool incorrectos

**ğŸ”´ SÃ­ntomas**:
```
R2(config)# ip nat inside source list R2NAT pool R2POOL overload
% Dynamic mapping not found
```

**ğŸ” DiagnÃ³stico**:

```cisco
R2# show ip nat pool
! No aparece R2POOL

R2# show access-lists
! No aparece R2NAT
```

**âœ… SoluciÃ³n**:

```cisco
! Eliminar configuraciÃ³n incorrecta
R2(config)# no ip nat inside source list [NOMBRE_INCORRECTO] pool [POOL_INCORRECTO] overload
R2(config)# no ip nat pool [POOL_INCORRECTO]
R2(config)# no ip access-list standard [ACL_INCORRECTA]

! Volver a Fase 1, 2 y 3 con nombres correctos: R2NAT y R2POOL
```

âš ï¸ **Importante**: Los nombres son case-sensitive. Debe ser exactamente `R2NAT` y `R2POOL`.

---

### Problema 4: Limpiar traducciones NAT (para troubleshooting)

```cisco
! Limpiar todas las traducciones dinÃ¡micas
R2# clear ip nat translation *

! Limpiar una traducciÃ³n especÃ­fica
R2# clear ip nat translation inside 192.168.10.10

! Reiniciar estadÃ­sticas
R2# clear ip nat statistics
```

---

## ğŸ’¡ Conceptos Clave y TeorÃ­a

### Â¿Por quÃ© usar NAT?

1. **ConservaciÃ³n de direcciones IPv4**: Solo hay ~4.3 mil millones de direcciones IPv4. NAT permite que miles de dispositivos privados compartan pocas IPs pÃºblicas.

2. **Seguridad adicional**: Oculta la estructura interna de la red. Desde el exterior, solo se ve la IP pÃºblica del router.

3. **Flexibilidad**: Permite cambiar de proveedor de Internet sin renumerar toda la red interna.

4. **ReutilizaciÃ³n de direcciones privadas**: MÃºltiples organizaciones pueden usar los mismos rangos privados (RFC 1918) sin conflictos.

### Direcciones IP Privadas (RFC 1918)

| Clase | Rango | CIDR | NÃºmero de Hosts |
|-------|-------|------|-----------------|
| Clase A | 10.0.0.0 - 10.255.255.255 | 10.0.0.0/8 | 16,777,216 |
| Clase B | 172.16.0.0 - 172.31.255.255 | 172.16.0.0/12 | 1,048,576 |
| Clase C | 192.168.0.0 - 192.168.255.255 | 192.168.0.0/16 | 65,536 |

En este laboratorio usamos redes **Clase C privadas** (192.168.x.0/24).

### Diferencias: NAT DinÃ¡mico vs NAT EstÃ¡tico vs PAT

| CaracterÃ­stica | NAT DinÃ¡mico | NAT EstÃ¡tico | PAT (Overload) |
|----------------|--------------|--------------|----------------|
| **Mapeo** | Temporal | Permanente | Temporal con puertos |
| **RelaciÃ³n** | N:N (pool) | 1:1 | N:1 |
| **Direccionalidad** | Insideâ†’Outside | Bidireccional | Insideâ†’Outside |
| **ConservaciÃ³n IP** | Media | Baja | Muy alta |
| **Uso tÃ­pico** | MÃºltiples usuarios | Servidores | Organizaciones pequeÃ±as/medianas |
| **Este lab** | - | local.pka | PC1, PC2, otros hosts |

---

## ğŸ“š Recursos y Referencias

### DocumentaciÃ³n Oficial de Cisco

- ğŸ“˜ [Cisco NAT Configuration Guide](https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipaddr_nat/configuration/15-mt/nat-15-mt-book.html)
- ğŸ“˜ [NAT: Local and Global Definitions](https://www.cisco.com/c/en/us/support/docs/ip/network-address-translation-nat/4606-8.html)
- ğŸ“˜ [Cisco Packet Tracer](https://www.netacad.com/courses/packet-tracer)
- ğŸ“˜ [Cisco IOS Command Reference](https://www.cisco.com/c/en/us/support/ios-nx-os-software/ios-15-4m-t/products-command-reference-list.html)

### RFCs Relevantes

| RFC | TÃ­tulo | AÃ±o |
|-----|--------|-----|
| **RFC 1918** | Address Allocation for Private Internets | 1996 |
| **RFC 1631** | The IP Network Address Translator (NAT) | 1994 |
| **RFC 3022** | Traditional IP Network Address Translator | 2001 |

### Tutoriales y Cursos Recomendados

- ğŸ¥ [Jeremy's IT Lab - Free CCNA 200-301 Course](https://www.youtube.com/c/JeremysITLab)
- ğŸ¥ [NetworkChuck - Cisco Packet Tracer Tutorials](https://www.youtube.com/c/NetworkChuck)
- ğŸ“– [Cisco Networking Academy](https://www.netacad.com/)
- ğŸ“– [Cisco Learning Network](https://learningnetwork.cisco.com/)

### Comunidades y Foros

- ğŸ’¬ [Reddit - r/ccna](https://www.reddit.com/r/ccna/)
- ğŸ’¬ [Cisco Community](https://community.cisco.com/)
- ğŸ’¬ [TechExams Forums - Cisco Certification](https://www.techexams.net/forums/)

---

## âœ… Checklist de ValidaciÃ³n Final

Antes de dar por completado el laboratorio, verifica todos estos puntos:

### ConfiguraciÃ³n

- [ ] âœ… ACL estÃ¡ndar `R2NAT` creada con nombre exacto
- [ ] âœ… Las 3 redes LAN permitidas en orden: LAN1 â†’ LAN2 â†’ LAN3
- [ ] âœ… Pool `R2POOL` creado con direcciÃ³n 209.165.202.129
- [ ] âœ… MÃ¡scara del pool correcta: 255.255.255.252
- [ ] âœ… NAT dinÃ¡mico configurado con palabra clave `overload`
- [ ] âœ… NAT estÃ¡tico configurado: 192.168.20.254 â†” 209.165.202.130
- [ ] âœ… Interfaces S0/0/0, S0/0/1, F0/0 marcadas como `inside`
- [ ] âœ… Interfaz S0/1/0 marcada como `outside`
- [ ] âœ… ConfiguraciÃ³n guardada con `write memory`

### VerificaciÃ³n

- [ ] âœ… `show ip nat translations` muestra traducciones activas
- [ ] âœ… `show ip nat statistics` muestra configuraciÃ³n correcta
- [ ] âœ… `show access-lists` muestra R2NAT con las 3 redes
- [ ] âœ… `show ip nat pool` muestra R2POOL correctamente
- [ ] âœ… PC1 puede hacer ping a 209.165.201.14
- [ ] âœ… PC2 puede hacer ping a 209.165.201.30
- [ ] âœ… PC-Exterior puede hacer ping a 209.165.202.130 (servidor)
- [ ] âœ… MÃºltiples hosts pueden acceder simultÃ¡neamente (PAT funciona)

---

## ğŸ“ Preguntas de ReflexiÃ³n

Para profundizar tu comprensiÃ³n, responde estas preguntas:

<details>
<summary><b>1. Â¿Por quÃ© es necesario usar PAT (overload) en este escenario?</b></summary>

**Respuesta**: Porque tenemos 3 redes internas (LAN1, LAN2, LAN3) con potencialmente decenas o cientos de hosts, pero solo una direcciÃ³n IP pÃºblica disponible para NAT dinÃ¡mico (209.165.202.129). PAT permite que todos estos dispositivos compartan esa Ãºnica IP pÃºblica diferenciando las conexiones mediante nÃºmeros de puerto Ãºnicos. Sin PAT, necesitarÃ­amos tantas IPs pÃºblicas como hosts simultÃ¡neos, lo cual es costoso e ineficiente.

</details>

<details>
<summary><b>2. Â¿CuÃ¡l es la diferencia entre las traducciones de PC1 y del servidor local.pka?</b></summary>

**Respuesta**: 
- **PC1 usa NAT dinÃ¡mico con PAT**: La traducciÃ³n solo existe cuando hay trÃ¡fico activo. El router asigna dinÃ¡micamente un puerto disponible en la IP 209.165.202.129. Cuando la conexiÃ³n termina, la traducciÃ³n se elimina.
- **Servidor local.pka usa NAT estÃ¡tico**: El mapeo 192.168.20.254 â†” 209.165.202.130 es permanente y siempre estÃ¡ en la tabla NAT, incluso sin trÃ¡fico. Esto permite que hosts externos inicien conexiones hacia el servidor.

</details>

<details>
<summary><b>3. Â¿QuÃ© pasarÃ­a si no se configura la interfaz Serial0/1/0 como "outside"?</b></summary>

**Respuesta**: NAT no funcionarÃ­a. El router necesita saber quÃ© interfaz conecta al mundo exterior para poder aplicar las traducciones correctamente. Sin una interfaz marcada como "outside", el router no sabrÃ­a dÃ³nde reemplazar las direcciones IP privadas por pÃºblicas ni dÃ³nde aplicar las traducciones inversas en el trÃ¡fico de retorno.

</details>

<details>
<summary><b>4. Â¿Por quÃ© la ACL usa wildcard mask en lugar de subnet mask?</b></summary>

**Respuesta**: Las ACLs de Cisco usan **wildcard masks**, que funcionan de manera opuesta a las subnet masks:
- **Subnet mask /24**: 255.255.255.0 (unos a la izquierda, ceros a la derecha)
- **Wildcard mask /24**: 0.0.0.255 (ceros a la izquierda, unos a la derecha)

La wildcard 0.0.0.255 significa "coincidir exactamente los primeros 3 octetos, ignorar el cuarto". Es equivalente a /24 pero con notaciÃ³n inversa.

</details>

<details>
<summary><b>5. Â¿QuÃ© ventajas de seguridad ofrece NAT?</b></summary>

**Respuesta**: 
1. **Ocultamiento de topologÃ­a**: Los hosts externos solo ven las IPs pÃºblicas del router, no la estructura interna ni direcciones privadas.
2. **ProtecciÃ³n contra escaneos**: Un atacante no puede saber cuÃ¡ntos dispositivos hay internamente ni sus direcciones.
3. **Punto de control centralizado**: Todo el trÃ¡fico pasa por el router NAT, donde se pueden aplicar polÃ­ticas de seguridad adicionales (ACLs, firewalls).
4. **Dificulta ataques directos**: Los hosts internos no son directamente accesibles desde Internet (excepto NAT estÃ¡tico explÃ­cito).

</details>

---

## ğŸ¤ Contribuciones

Este proyecto de laboratorio puede mejorarse continuamente. Â¡Las contribuciones son bienvenidas!

### CÃ³mo Contribuir

1. **Fork** este repositorio
2. Crea una rama para tu mejora (`git checkout -b feature/mejora-nat-ipv6`)
3. **Commit** tus cambios (`git commit -m 'AÃ±ade configuraciÃ³n de NAT64'`)
4. **Push** a la rama (`git push origin feature/mejora-nat-ipv6`)
5. Abre un **Pull Request**

### Ideas de Mejora

- ğŸ“Š Implementar NAT64 para transiciÃ³n IPv6
- ğŸ”’ AÃ±adir configuraciÃ³n de firewall con ACLs extendidas
- ğŸ“ˆ Documentar lÃ­mites de escalabilidad y optimizaciÃ³n
- ğŸ¨ Crear diagramas animados del flujo de paquetes
- ğŸ§ª Integrar scripts de pruebas automatizadas
- ğŸ“ Traducir documentaciÃ³n a otros idiomas

---

## ğŸ‘¨â€ğŸ’» Autor

<div align="center">

**Darwin Manuel Ovalles Cesar**

<p align="center">
<a href="https://www.linkedin.com/in/darwin-manuel-ovalles-cesar-dev/" target="_blank">
<img align="center" src="https://raw.githubusercontent.com/rahuldkjain/github-profile-readme-generator/master/src/images/icons/Social/linked-in-alt.svg" alt="LinkedIn - Darwin Ovalles" height="40" width="50" />
</a>
</p>

ğŸ’¼ **LinkedIn**: [darwin-manuel-ovalles-cesar-dev](https://www.linkedin.com/in/darwin-manuel-ovalles-cesar-dev/)  
ğŸŒ **GitHub**: [@dovalless](https://github.com/dovalless)  
ğŸ“§ **Email**: Disponible en LinkedIn

---

### Sobre el Autor

*Profesional en formaciÃ³n en el Ã¡rea de redes y telecomunicaciones, con enfoque en infraestructura de red empresarial y servicios de traducciÃ³n de direcciones. Este laboratorio forma parte de mi portafolio de prÃ¡cticas en Cisco Packet Tracer, demostrando competencias en configuraciÃ³n de routers Cisco IOS, protocolos de enrutamiento y servicios de red.*

**Ãreas de interÃ©s**: Redes empresariales, Seguridad de red, VirtualizaciÃ³n, Cloud Computing

</div>

---

## ğŸ“„ Licencia

Este proyecto tiene fines **exclusivamente educativos** y estÃ¡ disponible bajo la licencia MIT.

```
MIT License

Copyright (c) 2024 Darwin Manuel Ovalles Cesar

Se concede permiso para usar, copiar, modificar y distribuir este 
software con fines educativos y de aprendizaje.
```

Ver archivo [LICENSE](LICENSE) para mÃ¡s detalles.

---

## ğŸ† Agradecimientos

- ğŸ“ **Cisco Networking Academy** - Por proporcionar Packet Tracer y recursos educativos de calidad
- ğŸŒ **Comunidad CCNA** - Por compartir conocimientos y mejores prÃ¡cticas
- ğŸ“š **Cisco Press** - Por documentaciÃ³n tÃ©cnica exhaustiva
- ğŸ‘¥ **Instructores y Mentores** - Por guÃ­a y retroalimentaciÃ³n constante
- â˜• **Comunidad Open Source** - Por herramientas y recursos complementarios

---

## ğŸ“Š EstadÃ­sticas del Proyecto

<div align="center">

| MÃ©trica | Valor |
|---------|-------|
| **Dispositivo principal configurado** | Router R2 (Cisco 2900) |
| **Redes internas** | 3 LANs (10, 20, 30) |
| **Direcciones IP pÃºblicas utilizadas** | 2 de /30 |
| **Hosts soportados** | Ilimitados (gracias a PAT) |
| **Tiempo estimado del laboratorio** | 30-45 minutos |
| **Nivel de dificultad** | Intermedio |
| **Comandos Cisco IOS principales** | 15+ |
| **TecnologÃ­as implementadas** | NAT, PAT, ACL, Static Routing |

</div>

---

<div align="center">

## â­ Si este proyecto te fue Ãºtil, considera darle una estrella â­

**ğŸš€ Â¡Feliz configuraciÃ³n y aprendizaje de redes! ğŸš€**

---

Desarrollado con ğŸ’™ y â˜• para estudiantes de redes

**#CiscoPacketTracer #NAT #PAT #CCNA #Networking #CiscoIOS #RedesEmpresariales**

---

*Ãšltima actualizaciÃ³n: 2024*

</div>
```
